const limit1: string[] = [
  "お注射天使リリー",
  "黒き森のウィッチ",
  "サイバーポッド",
  "処刑人－マキュラ",
  "人造人間－サイコ・ショッカー",
  "ドル・ドラ",
  "ならず者傭兵部隊",
  "ニュート",
  "ファイバーポッド",
  "封印されしエクゾディア",
  "封印されし者の右腕",
  "封印されし者の右足",
  "封印されし者の左足",
  "封印されし者の左腕",
  "メタモルポット",
  "八汰烏",
  "いたずら好きな双子悪魔",
  "押収",
  "大嵐",
  "苦渋の選択",
  "強引な番兵",
  "強奪",
  "強欲な壺",
  "心変わり",
  "サンダー・ボルト",
  "死者蘇生",
  "団結の力",
  "手札抹殺",
  "成金ゴブリン",
  "ハーピィの羽根帚",
  "早すぎた埋葬",
  "光の護封剣",
  "ブラック・ホール",
  "魔導師の力",
  "リミッター解除",
  "王宮の勅命",
  "現世と冥界の逆転",
  "聖なるバリア －ミラーフォース－",
  "停戦協定",
  "破壊輪",
  "魔法の筒",
  "無謀な欲張り",
  "リビングデッドの呼び声",
]

const limit2: string[] = [
  "守護者スフィンクス",
  "カオスポッド",
  "切り込み隊長",
  "クリッター",
  "増援",
  "天使の施し",
  "フォース",
  "抹殺の使徒",
  "補充要員",
  "ラストバトル！",
]

// 制限: 1
// 準制限: 2
// 制限なし: 3
export const limit02 = (name: string): number => {
  if (limit1.includes(name)) {
    return 1
  }
  if (limit2.includes(name)) {
    return 2
  }
  return 3
}
